adikamat/ATmega16_WaterLevelSensor/Src/ATmega16_TC1.c
/**
  ******************************************************************************
  * @file    ATmega16_TC1.c
  * @author  GRT/AMK
  * @version V1.0
  * @date    02-Nov-2020
  * @brief   Driver for Timer/Counter1
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2020 Machine Control</center></h2>
  ******************************************************************************
  */
  
/** @addtogroup  Header
  * @{
  */
  
/** 
  * @brief  system header  
  */
#include "System.h"

/** 
  * @brief  Application specific header  
  */
#include "ATmega16_TC1.h"
#include "ATmega16_Port.h"
#include "ATmega16_Int.h"


/**
  * @}
  */
 
/** @addtogroup Struct/Union definition and Short Name
  * @{
  */ 
 
/**
  * @}
  */   
  
  
/** @addtogroup static variable 
  * @{
  */ 
/** 
  *@Var		FunctionNo
  *@brief   Variable hold the no for, which ClockResolution function was called.
  *			No and called function  relation is as follows.
  *			FunctionNo		 Fucntion Called
  *				0			TC1_SetClockResolution_P128USEC_8MHZ()
  *				1			TC1_SetClockResolution_1USEC_8MHZ()
  *				2			TC1_SetClockResolution_8USEC_8MHZ()
  *				3			TC1_SetClockResolution_32USEC_8MHZ()
  *				4			TC1_SetClockResolution_128USEC_8MHZ()
 */
			
 static uint8_t  TC1_FunctionNo = 0 ; /* This is default value*/
/**
  * @}
  */   
/** @addtogroup static fucntion 
  * @{
  */ 
  
/**
  * @}
  */   
  
/** @addtogroup variable declaration 
  * @{
  */ 
 
extern uint8_t  u8IntParam[] ;
 
/**
  * @}
  */      
/** @addtogroup  Static Function Definition 
  * @{ 
  */ 
  
  /**
  * @}
  */     
  
/** @addtogroup  Module Interface Function Definition 
  * @{
  */

/** @brief			TC1_ClearTimerOnCompareMode
  * @brief			when TC1 is set in this mode content of TCNT1 register is incremented every
  *					clock cycle.You can compare this register content against one of the 
  *					two registers OCR1A or ICR1. when TCNT1 count matches to on of them,TCNT1 is 
  *					clear that is set to 0.You can select which register to us with this function.  
  * @McuReg			TCCR1A[1:0] register WGM11:WGM10
  *					TCCR1B[4:3] register WGM13:WGM12
  * @PreCondition	None
  * @PostCondition	None
  * @param			u8CTCTop
  * @description	It has following value.
  *					TC1_TOP_OCR1A 
  *					TC1_TOP_ICR1
  * @test	Tested OK.	
  */
void    TC1_ClearTimerOnCompareMode(uint8_t u8CTCTop)
{
			if(u8CTCTop == TC1_TOP_OCR1A )
				{/* set WGM13 = 0 : WGM12= 1 :WGM11=0 : WGM10=0 */
					TCCR1A &= ~(TC1_TCCR1A_WGM10);
					TCCR1A &= ~(TC1_TCCR1A_WGM11);
					TCCR1B |= (TC1_TCCR1B_WGM12);
					TCCR1B &= ~(TC1_TCCR1B_WGM13);
					/* Set value into OCR1A Reg */
				}
			else if(u8CTCTop == TC1_TOP_ICR1 )
				{/* set WGM13 = 1 : WGM12= 1 :WGM11=0 : WGM10=0 */
					TCCR1A &= ~(TC1_TCCR1A_WGM10);
					TCCR1A &= ~(TC1_TCCR1A_WGM11);
					TCCR1B |= (TC1_TCCR1B_WGM12);
					TCCR1B |= (TC1_TCCR1B_WGM13);
				 
				}
		    else { 
				/* Error in Mode*/
				}		
}

/** @brief			TC1_ClearTimerOnComparePinMode
  * @brief			When TC1 is in	CTC(Clear timer on Compare) mode and TCNT1( timer reg) is matched
  *					with one of the OCR1A or ICR1 register set by TC1_ClearTimerOnCompareMode function.
  *					you can choose what event should happen to one of hardware pin OC1A or OC2B. 
  *					The events are
  *					TC1_PIN_DISCONNECTED
  *					TC1_PIN_TOGGLE_ON_MATCH
  *					TC1_PIN_CLEAR_ON_MATCH
  *					TC1_PIN_SET_ON_MATCHTC1
  *					Function allow you select pin as well as event on that pin. 
  * @McuReg			TCCR1A[5:4] register COM1B1: COM1B0
  *					TCCR1A[7:6] register COM1A1: COM1A0
  * @PreCondition	Function TC1_ClearTimerOnCompareMode should be called before calling this function.
  * @PostCondition	None
  * @param			u8Pin
  * @description	It has following value.
  *					TC1_PIN_OC1A
  *					TC1_PIN_OC2B
  * @param			u8CTCPinMode
  * @description	It has following value.
  *					TC1_PIN_DISCONNECTED	
  *					TC1_PIN_TOGGLE_ON_MATCH
  *					TC1_PIN_CLEAR_ON_MATCH
  *					TC1_PIN_SET_ON_MATCH
  * @test	Tested OK.		
  */
void TC1_ClearTimerOnComparePinMode(uint8_t u8Pin, uint8_t  u8CTCPinMode)
{
	 			if(u8Pin == TC1_PIN_OC1A)
				{		
							if(u8CTCPinMode == TC1_PIN_DISCONNECTED	)
							{/*Set COM1A1 = 0 : COM1A0 = 0 */
									TCCR1A &= ~(TC1_TCCR1A_COM1A0);
									TCCR1A &= ~(TC1_TCCR1A_COM1A1);
							}
						   if(u8CTCPinMode == TC1_PIN_TOGGLE_ON_MATCH)
							{/*Set COM1A1 = 0 : COM1A0 = 1 */
									TCCR1A |= (TC1_TCCR1A_COM1A0);
									TCCR1A &= ~(TC1_TCCR1A_COM1A1);
							}
							if(u8CTCPinMode == TC1_PIN_CLEAR_ON_MATCH)
							{/*Set COM1A1 = 1 : COM1A0 = 0 */
									TCCR1A &= ~(TC1_TCCR1A_COM1A0);
									TCCR1A |= (TC1_TCCR1A_COM1A1);
							}
							if(u8CTCPinMode == TC1_PIN_SET_ON_MATCH)
							{/*Set COM1A1 = 1 : COM1A0 = 1 */
									TCCR1A |= (TC1_TCCR1A_COM1A0);
									TCCR1A |= (TC1_TCCR1A_COM1A1);
							}
		       }/* End of  if (u8PinChannel== TC1_OC1A)*/
			   
			if(u8Pin == TC1_PIN_OC1B)
			  {
				    	if(u8CTCPinMode == TC1_PIN_DISCONNECTED)
						{ /*Set COM1B1 = 0 : COM1B0 = 0 */
								TCCR1A &= ~(TC1_TCCR1A_COM1B0);
								TCCR1A &= ~(TC1_TCCR1A_COM1B1);
						}
						if(u8CTCPinMode == TC1_PIN_TOGGLE_ON_MATCH)
						{/*Set COM1B1 = 0 : COM1B0 = 1 */
								TCCR1A |= (TC1_TCCR1A_COM1B0);
								TCCR1A &= ~(TC1_TCCR1A_COM1B1);
						}
						if(u8CTCPinMode == TC1_PIN_CLEAR_ON_MATCH)
						{/*Set COM1B1 = 1 : COM1B0 = 0 */
								TCCR1A &= ~(TC1_TCCR1A_COM1B0);
								TCCR1A |= (TC1_TCCR1A_COM1B1);
						}
						if(u8CTCPinMode == TC1_PIN_SET_ON_MATCH)
						{/*Set COM1B1 = 1 : COM1B0 = 1 */
								TCCR1A |= (TC1_TCCR1A_COM1B0);
								TCCR1A |= (TC1_TCCR1A_COM1B1);
						}
     	    }/* End of  if(u8PinChannel == TC1_OC2B)*/
			 
