adikamat/ATmega16_WaterLevelSensor/Src/ATmega16_TC1.c
}

/** @brief			TC1_FastPwmMode		
  * @brief			When TC1 is set in this mode to generate PWM, TCNT1 should be compared with
  *					either some Register or with Fixed value.So when the match occurs pin can be set
  *					or reset.Function allows to choose three fixed values 8BIT_TOP_0X00F/9BIT_TOP_0X01FF/
  *					10BIT_TOP_0X03FFF or two registers ICR1 or OCR1a. These are called TOP values in data sheets.
  *					This function set one      of the modes as mention in data sheet.    
  * @McuReg			TCCR1A[1:0] register WGM11:WGM10
  *					TCCR1B[4:3] register WGM13:WGM12
  * @PreCondition	None
  * @PostCondition  None
  * @param			u8FastPwmTopReg
  * @description	It has following value
  *					TC1_8BIT_TOP_0X00FF
  *					TC1_9BIT_TOP_0X01FF
  *					TC1_10BIT_TOP_0X03FF
  *					TC1_TOP_ICR1
  *					TC1_TOP_OCR1A
  * @test	Tested OK.		
  */  
void	TC1_FastPwmMode(uint8_t u8FastPwmTopReg)
{
			if(u8FastPwmTopReg == TC1_8BIT_TOP_0X00FF)
			{/* set WGM13 = 0 : WGM12= 1 :WGM11=0 : WGM10=1 */
					TCCR1A |= (TC1_TCCR1A_WGM10);
					TCCR1A &= ~(TC1_TCCR1A_WGM11);
					TCCR1B |= (TC1_TCCR1B_WGM12);
					TCCR1B &= ~(TC1_TCCR1B_WGM13);
			}
			if(u8FastPwmTopReg == TC1_9BIT_TOP_0X01FF)
			{/* set WGM13 = 0 : WGM12= 1 :WGM11=1 : WGM10=0 */
					TCCR1A &= ~(TC1_TCCR1A_WGM10);
					TCCR1A |= (TC1_TCCR1A_WGM11);
					TCCR1B |= (TC1_TCCR1B_WGM12);
					TCCR1B &= ~(TC1_TCCR1B_WGM13);
			}
			if(u8FastPwmTopReg == TC1_10BIT_TOP_0X03FF)
			{/* set WGM13 = 0 : WGM12= 1 :WGM11=1 : WGM10=1 */
					TCCR1A |= (TC1_TCCR1A_WGM10);
					TCCR1A |= (TC1_TCCR1A_WGM11);
					TCCR1B |= (TC1_TCCR1B_WGM12);
					TCCR1B &= ~(TC1_TCCR1B_WGM13);
			}
			if(u8FastPwmTopReg == TC1_TOP_ICR1)
			{/* set WGM13 = 1 : WGM12= 1 :WGM11=1 : WGM10=0 */
					TCCR1A &= ~(TC1_TCCR1A_WGM10);
					TCCR1A |= (TC1_TCCR1A_WGM11);
					TCCR1B |= (TC1_TCCR1B_WGM12);
					TCCR1B |= (TC1_TCCR1B_WGM13);
			}
			if(u8FastPwmTopReg == TC1_TOP_OCR1A)
			{/* set WGM13 = 1 : WGM12= 1 :WGM11=1 : WGM10=1 */
					TCCR1A |= (TC1_TCCR1A_WGM10);
					TCCR1A |= (TC1_TCCR1A_WGM11);
					TCCR1B |= (TC1_TCCR1B_WGM12) ;
			}
 }

/** @brief			TC1_FastPwmPinMode	
  * @brief			When TC1 is in FastPwmMode mode and TCNT1( timer reg) is matched with one of the TOP
  *					values set by TC1_FastPwmMode function you can choose what events should happen on OC1A
  *					and OC2B hardware pins.The events are
  *					TC1_PIN_DISCONNECTED
  *					TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED
  *					TC1_PIN_CLEAR_ON_MATCH_SET_ON_TOP
  *					TC1_PIN_SET_ON_MATCH_CLEAR_ON_TOP
  *					Function allows Which pin to select and what event should happen on that pin.	 
  * @McuReg			TCCR1A[5:4] register COM1B1: COM1B0
  *					TCCR1A[7:6] register COM1A1: COM1A0 
  * @PreCondition	Function TC1_FastPwmMode should be called before this function. 	
  * @PostCondition  None
   * @param			u8Pin
  * @description	It has following value.
  *					TC1_PIN_OC1A
  *					TC1_PIN_OC2B
  * @param			u8FastPwmPinMode
  * @description	It has following value
  *					TC1_PIN_DISCONNECTED
  *					TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED
  *					TC1_PIN_CLEAR_ON_MATCH_SET_ON_TOP
  *					TC1_PIN_SET_ON_MATCH_CLEAR_ON_TOP
  * @test	Tested OK.		
  */  	
void	TC1_FastPwmPinMode(uint8_t u8Pin,uint8_t  u8FastPwmPinMode)
{
		 		if(u8Pin == TC1_PIN_OC1A)
					{
						if(u8FastPwmPinMode == TC1_PIN_DISCONNECTED)
							{/*Set COM1A1 = 0 : COM1A0 = 0 */
								TCCR1A &= ~(TC1_TCCR1A_COM1A0);
								TCCR1A &= ~(TC1_TCCR1A_COM1A1);
							}
						if(u8FastPwmPinMode == TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED)
							{/*Set COM1A1 = 0 : COM1A0 = 1 */
								TCCR1A |= (TC1_TCCR1A_COM1A0);
								TCCR1A &= ~(TC1_TCCR1A_COM1A1);
							}
						if(u8FastPwmPinMode == TC1_PIN_CLEAR_ON_MATCH_SET_ON_TOP)
							{/*Set COM1A1 = 1 : COM1A0 = 0 */
								TCCR1A &= ~(TC1_TCCR1A_COM1A0);
								TCCR1A |= (TC1_TCCR1A_COM1A1);
							}
						if(u8FastPwmPinMode == TC1_PIN_SET_ON_MATCH_CLEAR_ON_TOP)
							{/*Set COM1A1 = 1 : COM1A0 = 1 */
								TCCR1A |= (TC1_TCCR1A_COM1A0);
								TCCR1A |= (TC1_TCCR1A_COM1A1);
							}
					
				 }/* End of  if if(u8Pin == TC1_OC1A)*/
					
			 if(u8Pin == TC1_PIN_OC1B)
				{
						 if(u8FastPwmPinMode == TC1_PIN_DISCONNECTED)
						 {/*Set COM1B1 = 0 : COM1B0 = 0 */
							 TCCR1A &= ~(TC1_TCCR1A_COM1B0);
							 TCCR1A &= ~(TC1_TCCR1A_COM1B1);
						 }
						 if(u8FastPwmPinMode == TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED)
						 {/*Set COM1B1 = 0 : COM1B0 = 1 */
							 TCCR1A |= (TC1_TCCR1A_COM1B0);
							 TCCR1A &= ~(TC1_TCCR1A_COM1B1);
						 }
						 if(u8FastPwmPinMode == TC1_PIN_CLEAR_ON_MATCH_SET_ON_TOP)
						 {/*Set COM1B1 = 1 : COM1B0 = 0 */
							 TCCR1A &= ~(TC1_TCCR1A_COM1B0);
							 TCCR1A |= (TC1_TCCR1A_COM1B1);
						 }
						 if(u8FastPwmPinMode == TC1_PIN_SET_ON_MATCH_CLEAR_ON_TOP)
						 {/*Set COM1B1 = 1 : COM1B0 = 1 */
							 TCCR1A |= (TC1_TCCR1A_COM1B0);
							 TCCR1A |= (TC1_TCCR1A_COM1B1);
						 }
				   }/* End of  if(u8Channel == TC1_OC2B)*/
				  
}

/** @brief			TC1_PwmPhaseMode	
  * @brief			When TC1 is set in this mode to generate PWM, TCNT1 should be compared with
  *					either some Register or with Fixed value.So when the match occurs pin can be set
  *					or reset.Function allows to choose three fixed values 8BIT_TOP_0X00F/9BIT_TOP_0X01FF/
  *					10BIT_TOP_0X03FFF or two registers ICR1 or OCR1a. These are called TOP values in data sheets.
  *					This function set one of the modes as mention in data sheet.
  * @McuReg			TCCR1A[1:0] register WGM11:WGM10
  *					TCCR1B[4:3] register WGM13:WGM12
  * @PreCondition	None
  * @PostCondition  None
  * @param			u8PwmPhaseTop
  * @description	It has following value
  *					TC1_8BIT_TOP_0X00FF
  *					TC1_9BIT_TOP_0X01FF
  *					TC1_10BIT_TOP_0X03FF
  *					TC1_TOP_ICR1
  *					TC1_TOP_OCR1A	
  * @test	Tested OK.		
  */  
void	TC1_PwmPhaseMode(uint8_t u8PwmPhaseTop)
{
			if(u8PwmPhaseTop == TC1_8BIT_TOP_0X00FF)
				{/* set WGM13 = 0 : WGM12= 0 :WGM11=0 : WGM10=1 */
					TCCR1A |= (TC1_TCCR1A_WGM10);
					TCCR1A &= ~(TC1_TCCR1A_WGM11);
					TCCR1B &= ~(TC1_TCCR1B_WGM12);
					TCCR1B &= ~(TC1_TCCR1B_WGM13);
				}
				if(u8PwmPhaseTop == TC1_9BIT_TOP_0X01FF)
				{/* set WGM13 = 0 : WGM12= 0 :WGM11=1 : WGM10=0 */
					TCCR1A &= ~(TC1_TCCR1A_WGM10);
					TCCR1A |= (TC1_TCCR1A_WGM11);
					TCCR1B &= ~(TC1_TCCR1B_WGM12);
					TCCR1B &= ~(TC1_TCCR1B_WGM13);
				}
				if(u8PwmPhaseTop == TC1_10BIT_TOP_0X03FF)
				{/* set WGM13 = 0 : WGM12= 0 :WGM11=1 : WGM10=1 */
					TCCR1A |= (TC1_TCCR1A_WGM10);
					TCCR1A |= (TC1_TCCR1A_WGM11);
					TCCR1B &= ~(TC1_TCCR1B_WGM12);
					TCCR1B &= ~(TC1_TCCR1B_WGM13);
				}
				if(u8PwmPhaseTop == TC1_TOP_ICR1)
				{/* set WGM13 = 1 : WGM12= 0 :WGM11=1 : WGM10=0 */
					TCCR1A &= ~(TC1_TCCR1A_WGM10);
					TCCR1A |= (TC1_TCCR1A_WGM11);
					TCCR1B &= ~(TC1_TCCR1B_WGM12);
					TCCR1B |= (TC1_TCCR1B_WGM13);
				}
				if(u8PwmPhaseTop == TC1_TOP_OCR1A)
				{/* set WGM13 = 1 : WGM12= 0 :WGM11=1 : WGM10=1 */
					TCCR1A |= (TC1_TCCR1A_WGM10);
					TCCR1A |= (TC1_TCCR1A_WGM11);
					TCCR1B &= ~(TC1_TCCR1B_WGM12);
					TCCR1B |= (TC1_TCCR1B_WGM13);
				}
				
