adikamat/ATmega16_WaterLevelSensor/Src/ATmega16_TC1.c
}
/** @brief			TC1_PwmPhasePinMode		
  * @brief			When TC1 is in PwmPhaseMode mode and TCNT1( timer reg) is matched with one of the TOP
  *					values set by TC1_PwmPhaseMode function you can choose what events should happen on OC1A
  *					and OC2B hardware pins.The events are
  *					TC1_PIN_DISCONNECTED
  *					TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED
  *					TC1_PIN_CLEAR_ON_UPCOUNTING_SET_ON_DOWNCOUNING
  *					TC1_PIN_SET_ON_UPCOUNTING_CLEAR_ON_DOWNCOUNING
  *					Function allows Which pin to select and what event should happen on that pin.
  * @McuReg			TCCR1A[5:4] register COM1B1: COM1B0
  *					TCCR1A[7:6] register COM1A1: COM1A0 
  * @PreCondition	Function TC1_PwmPhaseMode should be called before this function.	
  * @PostCondition  None
   * @param			u8Pin
  * @description	It has following value.
  *					TC1_PIN_OC1A
  *					TC1_PIN_OC2B
  * @param			u8PwmPhasePinMode
  * @description	It has following value
  *					TC1_PIN_DISCONNECTED
  *					TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED
  *					TC1_PIN_CLEAR_ON_UPCOUNTING_SET_ON_DOWNCOUNING
  *					TC1_PIN_SET_ON_UPCOUNTING_CLEAR_ON_DOWNCOUNING
  * @test	Tested OK.		
  */  		
void	TC1_PwmPhasePinMode(uint8_t u8Pin,uint8_t  u8PwmPhasePinMode)
{
				if(u8Pin == TC1_PIN_OC1A)
					{
						 if(u8PwmPhasePinMode == TC1_PIN_DISCONNECTED)
						 {/*Set COM1A1 = 0 : COM1A0 = 0 */
							 TCCR1A &= ~(TC1_TCCR1A_COM1A0);
							 TCCR1A &= ~(TC1_TCCR1A_COM1A1);
						 }
						 if(u8PwmPhasePinMode == TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED)
						 {/*Set COM1A1 = 0 : COM1A0 = 1 */
							 TCCR1A |= (TC1_TCCR1A_COM1A0);
							 TCCR1A &= ~(TC1_TCCR1A_COM1A1);
						 }
						 if(u8PwmPhasePinMode == TC1_PIN_CLEAR_ON_UPCOUNTING_SET_ON_DOWNCOUNING)
						 {/*Set COM1A1 = 1 : COM1A0 = 0 */
							 TCCR1A &= ~(TC1_TCCR1A_COM1A0);
							 TCCR1A |= (TC1_TCCR1A_COM1A1);
						 }
						 if(u8PwmPhasePinMode == TC1_PIN_SET_ON_UPCOUNTING_CLEAR_ON_DOWNCOUNING)
						 {/*Set COM1A1 = 1 : COM1A0 = 1 */
							 TCCR1A |= (TC1_TCCR1A_COM1A0);
							 TCCR1A |= (TC1_TCCR1A_COM1A1);
						 }
					}
					
					if(u8Pin == TC1_PIN_OC1B)
					{
						 if(u8PwmPhasePinMode == TC1_PIN_DISCONNECTED)
						 {/*Set COM1B1 = 0 : COM1B0 = 0 */
							 TCCR1A &= ~(TC1_TCCR1A_COM1B0);
							 TCCR1A &= ~(TC1_TCCR1A_COM1B1);
						  }
						  if(u8PwmPhasePinMode == TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED)
						  {/*Set COM1B1 = 0 : COM1B0 = 1 */
							  TCCR1A |= (TC1_TCCR1A_COM1B0);
							  TCCR1A &= ~(TC1_TCCR1A_COM1B1);
						  } 
						 if(u8PwmPhasePinMode == TC1_PIN_CLEAR_ON_UPCOUNTING_SET_ON_DOWNCOUNING)
						 {/*Set COM1B1 = 1 : COM1B0 = 0 */
							 TCCR1A &= ~(TC1_TCCR1A_COM1B0);
							 TCCR1A |= (TC1_TCCR1A_COM1B1);
						 }
						 if(u8PwmPhasePinMode == TC1_PIN_SET_ON_UPCOUNTING_CLEAR_ON_DOWNCOUNING)
						 {/*Set COM1B1 = 1 : COM1B0 = 1 */
							 TCCR1A |= (TC1_TCCR1A_COM1B0);
							 TCCR1A |= (TC1_TCCR1A_COM1B1);
						 }
				  }
}

  /** @brief		TC1_PwmPhaseFrequencyMode
  * @brief			When TC1 is set in this mode to generate PWM, TCNT1 should be compared with
  *					either some Register.So when the match occurs pin can be set or reset.Function allows
  *					two registers ICR1 or OCR1a. These are called TOP values in data sheets.
  *					This function set one of       the modes as mention in data sheet.
  * @McuReg			TCCR1A[1:0] register WGM11:WGM10
  *					TCCR1B[4:3] register WGM13:WGM12
  * @PreCondition	None
  * @PostCondition  None
  * @param			u8PwmPhaseFrequencyTop
  * @description	It has following value
  *					TC1_TOP_ICR1 
  *					TC1_TOP_OCR1A
  * @test	Tested OK.		
  */  
void	TC1_PwmPhaseFrequencyMode(uint8_t u8PwmPhaseFrequencyTop)
{
	    			if(u8PwmPhaseFrequencyTop == TC1_TOP_ICR1)
					{/* set WGM13 = 1 : WGM12= 0 :WGM11=0 : WGM10=0 */
						TCCR1A &= ~(TC1_TCCR1A_WGM10);
						TCCR1A &= ~(TC1_TCCR1A_WGM11);
						TCCR1B &= ~(TC1_TCCR1B_WGM12);
						TCCR1B |= (TC1_TCCR1B_WGM13);
					}
					if(u8PwmPhaseFrequencyTop == TC1_TOP_OCR1A)
					{/* set WGM13 = 1 : WGM12= 0 :WGM11=0 : WGM10=1 */
						TCCR1A |= (TC1_TCCR1A_WGM10);
						TCCR1A &= ~(TC1_TCCR1A_WGM11);
						TCCR1B &= ~(TC1_TCCR1B_WGM12);
						TCCR1B |= (TC1_TCCR1B_WGM13);
					}
}
/** @brief			TC1_PwmPhaseFrequencyPinMode
  * @brief			When TC1 is in PwmPhaseFrequencyMode mode and TCNT1( timer reg) is matched with one of the TOP
  *					values set by TC1_PwmPhaseFrequencyMode function you can choose what events should happen 
  *					on OC1A	and OC2B hardware pins.The events are
  *					TC1_PIN_DISCONNECTED
  *					TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED
  *					TC1_PIN_CLEAR_ON_UPCOUNTING_SET_ON_DOWNCOUNING
  *					TC1_PIN_SET_ON_UPCOUNTING_CLEAR_ON_DOWNCOUNING
  *					Function allows Which pin to select and what event should happen on that pin.
  * @McuReg			TCCR1A[5:4] register COM1B1: COM1B0
  *					TCCR1A[7:6] register COM1A1: COM1A0 
  * @PreCondition	Function TC1_PwmPhaseFrequencyMode should be called before this function.
  * @PostCondition  None
  * @param			u8Pin
  * @description	It has following value.
  *					TC1_PIN_OC1A
  *					TC1_PIN_OC2B
  * @param			u8PwmPhaseFrequencyPinMode
  * @description	It has following value
  *					TC1_PIN_DISCONNECTED
  *					TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED
  *					TC1_PIN_CLEAR_ON_UPCOUNTING_SET_ON_DOWNCOUNING
  *					TC1_PIN_SET_ON_UPCOUNTING_CLEAR_ON_DOWNCOUNING
  * @test	Tested OK.		
  */  		
void	TC1_PwmPhaseFrequencyPinMode(uint8_t u8Pin,uint8_t  u8PwmPhaseFrequencyPinMode)
{
			if(u8Pin == TC1_PIN_OC1A)
				{
						if(u8PwmPhaseFrequencyPinMode == TC1_PIN_DISCONNECTED)
						{/*Set COM1A1 = 0 : COM1A0 = 0 */
							TCCR1A &= ~(TC1_TCCR1A_COM1A0);
							TCCR1A &= ~(TC1_TCCR1A_COM1A1);
						}
						if(u8PwmPhaseFrequencyPinMode == TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED)
						{/*Set COM1A1 = 0 : COM1A0 = 1 */
							TCCR1A |= (TC1_TCCR1A_COM1A0);
							TCCR1A &= ~(TC1_TCCR1A_COM1A1);
						}
						if(u8PwmPhaseFrequencyPinMode == TC1_PIN_CLEAR_ON_UPCOUNTING_SET_ON_DOWNCOUNING)
						{/*Set COM1A1 = 1 : COM1A0 = 0 */
							TCCR1A &= ~(TC1_TCCR1A_COM1A0);
							TCCR1A |= (TC1_TCCR1A_COM1A1);
						}
						if(u8PwmPhaseFrequencyPinMode == TC1_PIN_SET_ON_UPCOUNTING_CLEAR_ON_DOWNCOUNING)
						{/*Set COM1A1 = 1 : COM1A0 = 1 */
							TCCR1A |= (TC1_TCCR1A_COM1A0);
							TCCR1A |= (TC1_TCCR1A_COM1A1);
						}
					
