adikamat/ATmega16_WaterLevelSensor/Src/ATmega16_TC1.c
				}
					
			if(u8Pin == TC1_PIN_OC1B)
			{
						 if(u8PwmPhaseFrequencyPinMode == TC1_PIN_DISCONNECTED)
						 {/*Set COM1B1 = 0 : COM1B0 = 0 */
							 TCCR1A &= ~(TC1_TCCR1A_COM1B0);
							 TCCR1A &= ~(TC1_TCCR1A_COM1B1);
						 }
						 if(u8PwmPhaseFrequencyPinMode == TC1_OC1A_PIN_TOGGLE_ON_MATCH_OC1B_DISCONNECTED)
						 {/*Set COM1B1 = 0 : COM1B0 = 1 */
							 TCCR1A |= (TC1_TCCR1A_COM1B0);
							 TCCR1A &= ~(TC1_TCCR1A_COM1B1);
						 }
						 if(u8PwmPhaseFrequencyPinMode == TC1_PIN_CLEAR_ON_UPCOUNTING_SET_ON_DOWNCOUNING)
						 {/*Set COM1B1 = 1 : COM1B0 = 0 */
							 TCCR1A &= ~(TC1_TCCR1A_COM1B0);
							 TCCR1A |= (TC1_TCCR1A_COM1B1);
						 }
						 if(u8PwmPhaseFrequencyPinMode == TC1_PIN_SET_ON_UPCOUNTING_CLEAR_ON_DOWNCOUNING)
						 {/*Set COM1B1 = 1 : COM1B0 = 1 */
							 TCCR1A |= (TC1_TCCR1A_COM1B0);
							 TCCR1A |= (TC1_TCCR1A_COM1B1);
						 }
			}
}

/** @brief			TC1_TimerMode		
  * @brief			Set TC1 in TimerMode. 
  * @McuReg			TCCR1B[2:0]  CS12:CS11:CS10 
  * @PreCondition	None
  * @PostCondition  None
  * @param			u8Mode
  * @description    This has Value 
  *					TC1_TOP_0XFFFF
  * @retval			None
  * @test	Tested OK.		
  */
void TC1_TimerMode(uint8_t u8Mode)
{
	if(u8Mode  == TC1_TOP_0XFFFF)
	{/* set WGM13 = 0 : WGM12= 0 :WGM11=0 : WGM10=0 */
		TCCR1A &= ~(TC1_TCCR1A_WGM10);
		TCCR1A &= ~(TC1_TCCR1A_WGM11);
		TCCR1B &= ~(TC1_TCCR1B_WGM12);
		TCCR1B &= ~(TC1_TCCR1B_WGM13);
	}
}	

/** @brief			TC1_SetCounterModeEdge	
  * @brief			Set TC1 in  counter Mode.Counting takes place either on Falling or rising Edge. 
  * @McuReg			TCCR1B[2:0]  CS12:CS11:CS10 . Mcu pin 2 (T1)
  * @PreCondition	None
  * @PostCondition  None
  * @param			Edge
  * @description    This has Value 
  *					TC1_CLK_FALLING_EDGE_ON_T1_PIN
  *					TC1_CLK_RISING_EDGE_ON_T1_PIN	
  * @retval			None
    * @test	Tested OK.		
  */
void	TC1_SetCounterModeEdge(uint8_t u8Edge)
{
	if(u8Edge == TC1_CLK_FALLING_EDGE_ON_T1_PIN)
	{  /* CS12 =1 :CS11 =1 :CS10= 0*/
		TCCR1B &= ~(TC1_TCCR1B_CS10);
		TCCR1B |= (TC1_TCCR1B_CS11);
		TCCR1B |= (TC1_TCCR1B_CS12);
	}
	else if(u8Edge == TC1_CLK_RISING_EDGE_ON_T1_PIN)
	{   /* CS12 =1 :CS11 =1 :CS10= 1*/
		TCCR1B |= (TC1_TCCR1B_CS10);
		TCCR1B |= (TC1_TCCR1B_CS11);
		TCCR1B |= (TC1_TCCR1B_CS12);
	}
	else
	{
		
	}
}
		
/** @brief			TC1_SetInputCapturePin	
  * @brief			Set Input Capture Source Mcu pin 20 ICP1 
  * @McuReg			ACSR[3] ACIC 
  * @PreCondition	None
  * @PostCondition  None
  * @param			u8InputCapturePin
  * @description	PORTx_Pxy  where x is A/B/C/D and y is 0 to 7 
  *	
  * @retval			None	
  */
void TC1_SetInputCapturePin(uint8_t u8InputCapturePin)	 
 {
	//if(u8InputCapturePin == TC1_PIN_ICP1)
	{
		/*Set Pin Direction as Input*/
		Port_SetPinDirection(u8InputCapturePin,PORT_IN);  
	}
}

/** @brief			TC1_SetInputCaptureEdge		
  * @brief			Set Input Capture Source  edge Mcu pin 20 ICP1 
  * @McuReg			TCCR1B[7:6] ICNC1 : ICES1 
  * @PreCondition	None
  * @PostCondition  None
  * @param			u8CaptureEdge 
  * @description    This has Value 
  *					TC1_INPUT_CAPTURE_RISING_EDGE
  *					TC1_INPUT_CAPTURE_FALLING_EDGE
  * @retval			None	
  * @test	Tested OK.		
  */
void TC1_SetInputCaptureEdge(uint8_t u8CaptureEdge)	 
{
	if(u8CaptureEdge == TC1_INPUT_CAPTURE_FALLING_EDGE)
	{	/* ICES1 = 0*/
		TCCR1B &= ~(TC1_TCCR1B_ICES1);
	}
	if(u8CaptureEdge == TC1_INPUT_CAPTURE_RISING_EDGE)
	{		/* ICES1 = 1*/
		TCCR1B |= (TC1_TCCR1B_ICES1);
	}
}
/** @brief			TC1_SetTimerReg		
  * @brief			Write the TCNT1 Register.
  * @McuReg			TCNT1		 
  * @PreCondition	None
  * @PostCondition  None
  * @param			u16Count
  * @description    Count to be loaded into timer register.	
  * @retval			None
  * @test		
  */

void TC1_SetTimerReg(uint16_t u16Count)
{ 
uint8_t  u8TCNT1L,u8TCNT1H;	
	 /* To Write TCNT1 16 bit register, Write TCNT1H first 
	    and TCNT1L next as per manual page 90
	  */
		 u8TCNT1L  = (uint8_t)u16Count ;
		 u8TCNT1H = u16Count >>8 ;
		 TCNT1H = u8TCNT1H;
		 TCNT1L= u8TCNT1L;
}			

/** @brief			TC1_GetTimerReg		
  * @brief			Read the TCNT1 Register.
  * @McuReg			TCNT1		 
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description    	
  * @retval			uint16_t Register Value TCNT1.	
  * @test	Tested OK.		
  */

uint16_t TC1_GetTimerReg(void)
{ 
uint16_t u16TCNT1;
uint8_t  u8TCNT1L,u8TCNT1H;	
	 /* To Read TCNT1 16 bit register, Read TCNT1L first 
	    and TCNT1H next as per manual page 90
	  */
		u8TCNT1L = TCNT1L;
		u8TCNT1H = TCNT1H;
	/* Combine two bytes into one*/
		u16TCNT1  = u8TCNT1H ;
		u16TCNT1 = u8TCNT1H <<8 ;
	    u16TCNT1 |= u8TCNT1L ;
 		return ( u16TCNT1);
}			

/** @brief			TC1_SetCompareReg				
  * @brief			Load OCR1A or OCR1B register with Value.
  * @McuReg		    OCR1AH : OCR1AL
  *					OCR1BH : OCR1BL 
  * @PreCondition	None
  * @PostCondition  None
  * @param			u8CompReg
  * @description    It has following values 
  *					TC1_OCR1A_REG......means OCR1A Reg is Loaded.	
  *					TC1_OCR1B_REG......means OCR1B Reg is Loaded
  *					TC1_ICR1_REG.......means ICR1 Reg is Loaded
  * @param			u16Value
  * @description    It is 16 bit value which is loaded into register
  * @retval			None
   * @test	Tested OK.					
  */
void TC1_SetCompareReg(uint8_t u8CompReg, uint16_t u16Value)
{
	uint8_t u8ValueL,u8ValueH;
	/* To Write OCR1x 16 bit register, Write OCR1xH first 
	    and OCR1xL next as per manual page 90
	  */
	/* Split Value into Low and High Byte */
	     u8ValueL = (uint8_t)u16Value;
		 u8ValueH = (uint8_t)(u16Value >> 8); 
	if(u8CompReg == TC1_OCR1A_REG)
	{ 
		OCR1AH = u8ValueH;
		OCR1AL = u8ValueL;
	}
	else if(u8CompReg == TC1_OCR1B_REG)
	{
		OCR1BH = u8ValueH;
		OCR1BL = u8ValueL;
	}
	else if(u8CompReg == TC1_ICR1_REG)
	{
		ICR1H = u8ValueH;
		ICR1L = u8ValueL;
	}
	else
	{
		
	}
}		

/** @brief			TC1_GetCaptureReg				
  * @brief			Get the ICR1 register Value. 
  * @McuReg			ICR1H: ICR1L
  * @PreCondition	None
  * @PostCondition  None
  * @param			Void
  * @description    None	
  * @retval
  * @test	Tested OK.					
  */
uint16_t TC1_GetCaptureReg(void)
{
 uint16_t u16CaptureValue;
  uint8_t  u8CaptureValueH,u8CaptureValueL;	
	 ///* To Read ICR1 16 bit register, Read ICR1L first 
	    //and ICR1H next as per manual page 90
	  //*/
		u8CaptureValueL = ICR1L;
		u8CaptureValueH = ICR1H;
	/* Combine two bytes into one*/
		u16CaptureValue = u8CaptureValueH ;
		u16CaptureValue = u16CaptureValue << 8;
		u16CaptureValue |= u8CaptureValueL ;
		return u16CaptureValue ;
}	


/** @brief			TC1_StopClock				
  * @brief			Set Prescalar to 0. 
  * @McuReg			TCCR1B[2:0]  CS12:CS11:CS10 
  * @PreCondition	None
  * @PostCondition  None
  * @param			None
  * @description	Stop Clock to Prescalar.
  * @retval			None
  * @test	Tested OK.			
  */
void TC1_StopClock(void)
{	
	/* CS12 =0 :CS11 =0 :CS10= 0*/
	TCCR1B &= ~(TC1_TCCR1B_CS10);
	TCCR1B &= ~(TC1_TCCR1B_CS11);
	TCCR1B &= ~(TC1_TCCR1B_CS12); 
}

/** @brief			TC1_StartClock				
  * @brief			Set Prescalar to 0. 
  * @McuReg			TCCR1B[2:0]  CS12:CS11:CS10 
  * @PreCondition	None
  * @PostCondition  None
  * @param			None
  * @description	Start Clock by Loading  Prescalar Value.
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_StartClock(void)
{   
	/*	There is no start bit for starting timer. WhenPrescalar value
	    is loaded timer start.Based on FunctionNo we load prescalar
    */
	if(TC1_FunctionNo == 0)
	{
		TC1_SetClockResolution_P125USEC_8MHZ();
	}
	else if(TC1_FunctionNo == 1)
	{
		TC1_SetClockResolution_1USEC_8MHZ();			
	}
	else if(TC1_FunctionNo == 2)
	{
		TC1_SetClockResolution_8USEC_8MHZ();
	}
	else if(TC1_FunctionNo == 3)
	{
		TC1_SetClockResolution_32USEC_8MHZ();
	}
	else if(TC1_FunctionNo == 4)
	{
		TC1_SetClockResolution_128USEC_8MHZ();
	}
	else{}
}

			
/** @brief			TC1_SetClockPrescalar		
  * @brief			Set Prescalar to Timer/Counter1 Module. 
  * @McuReg			TCCR1B[2:0]  CS12:CS11:CS10 
  * @PreCondition	None
  * @PostCondition  None
  * @param			u8Prescalar
  * @description	It is one of the following.
  *					TC1_CLK_DIRECT_NO_PRESCALAR
  *					TC1_CLK_IO_BY_X X= 8/64/256/1024/
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockPrescalar(uint8_t u8Prescalar)
{
	if(u8Prescalar == TC1_CLK_DIRECT_NO_PRESCALAR)
	{	/* CS12 =0 :CS11 =0 :CS10= 1*/
		TCCR1B |= (TC1_TCCR1B_CS10);
		TCCR1B &= ~(TC1_TCCR1B_CS11);
		TCCR1B &= ~(TC1_TCCR1B_CS12);
	}
	else if(u8Prescalar == TC1_CLK_IO_BY_8)
	{	/* CS12 =0 :CS11 =1 :CS10= 0*/
		TCCR1B &= ~(TC1_TCCR1B_CS10);
		TCCR1B |= (TC1_TCCR1B_CS11);
		TCCR1B &= ~(TC1_TCCR1B_CS12);
	}
	else if(u8Prescalar == TC1_CLK_IO_BY_64)
	{	/* CS12 =0 :CS11 =1 :CS10= 1*/
		TCCR1B |= (TC1_TCCR1B_CS10);
		TCCR1B |= (TC1_TCCR1B_CS11);
		TCCR1B &= ~(TC1_TCCR1B_CS12);
	}
	else if(u8Prescalar == TC1_CLK_IO_BY_256)
	{	/* CS12 = 1 :CS11 =0 :CS10= 0*/
		TCCR1B &= ~(TC1_TCCR1B_CS10);
		TCCR1B &= ~(TC1_TCCR1B_CS11);
		TCCR1B |= (TC1_TCCR1B_CS12);
	}
	else if(u8Prescalar == TC1_CLK_IO_BY_1024)
	{	/* CS12 =1 :CS11 =0 :CS10= 1*/
		TCCR1B |= (TC1_TCCR1B_CS10);
		TCCR1B &= ~(TC1_TCCR1B_CS11);
		TCCR1B |= (TC1_TCCR1B_CS12);
	}
	else
	{
	}
}

/** @brief			TC1_SetClockResolution_P128USEC		
  * @brief			Set TC1 Timer Resolution to 0.128 usec at 8 Mhz Crystal. 
  * @McuReg			Noe
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description	None
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockResolution_P125USEC_8MHZ(void)
{
	TC1_SetClockPrescalar(TC1_CLK_DIRECT_NO_PRESCALAR);
	TC1_FunctionNo = 0;
} 
/** @brief			TC1_SetClockResolution_P0625USEC_16MHZ		
  * @brief			Set TC1 Timer Resolution to 0.0625usec at 16 Mhz Crystal. 
  * @McuReg			Noe
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description	None
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockResolution_P0625USEC_16MHZ(void)
{
	TC1_SetClockPrescalar(TC1_CLK_DIRECT_NO_PRESCALAR);
	TC1_FunctionNo = 0;
}

/** @brief			TC1_SetClockResolution_1USEC		
  * @brief			Set TC1 Timer Resolution to 1 usec at 8 Mhz Crystal.. 
  * @McuReg			Noe
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description	None
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockResolution_1USEC_8MHZ(void)
{
	TC1_SetClockPrescalar(TC1_CLK_IO_BY_8);
	TC1_FunctionNo = 1;
} 
/** @brief			TC1_SetClockResolution_P5USEC_16MHZ	
  * @brief			Set TC1 Timer Resolution to 0.5 usec at 16 Mhz Crystal.. 
  * @McuReg			Noe
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description	None
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockResolution_P5USEC_16MHZ(void)
{
	TC1_SetClockPrescalar(TC1_CLK_IO_BY_8);
	TC1_FunctionNo = 1;
}

/** @brief			TC1_SetClockResolution_8USEC		
  * @brief			Set TC1 Timer Resolution to 8 usec at 8 Mhz Crystal.. 
  * @McuReg			Noe
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description	None
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockResolution_8USEC_8MHZ(void)
{
	TC1_SetClockPrescalar(TC1_CLK_IO_BY_64);
	TC1_FunctionNo = 2;
} 
/** @brief			TC1_SetClockResolution_4USEC_16MHZ		
  * @brief			Set TC1 Timer Resolution to 4 usec at 16 Mhz Crystal.. 
  * @McuReg			Noe
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description	None
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockResolution_4USEC_16MHZ(void)
{
	TC1_SetClockPrescalar(TC1_CLK_IO_BY_64);
	TC1_FunctionNo = 2;
}


