adikamat/ATmega16_WaterLevelSensor/Src/ATmega16_TC1.c
/** @brief			TC1_SetClockResolution_32USEC		
  * @brief			Set TC1 Timer Resolution to 32 usec at 8 Mhz Crystal.. 
  * @McuReg			None
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description	None
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockResolution_32USEC_8MHZ(void)
{
	TC1_SetClockPrescalar(TC1_CLK_IO_BY_256);
	TC1_FunctionNo = 3;
} 
/** @brief			TC1_SetClockResolution_16USEC_16MHZ		
  * @brief			Set TC1 Timer Resolution to 16 usec at 16 Mhz Crystal.. 
  * @McuReg			None
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description	None
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockResolution_16USEC_16MHZ(void)
{
	TC1_SetClockPrescalar(TC1_CLK_IO_BY_256);
	TC1_FunctionNo = 3;
}

/** @brief			TC1_SetClockResolution_128USEC		
  * @brief			Set TC1 Timer Resolution to 128 usec at 8 Mhz Crystal.. 
  * @McuReg			None
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description	None
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockResolution_128USEC_8MHZ(void)
{
	TC1_SetClockPrescalar(TC1_CLK_IO_BY_1024);
	TC1_FunctionNo = 4;
} 
/** @brief			TC1_SetClockResolution_64USEC_16MHZ		
  * @brief			Set TC1 Timer Resolution to 64 usec at 16 Mhz Crystal.. 
  * @McuReg			None
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description	None
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_SetClockResolution_64USEC_16MHZ(void)
{
	TC1_SetClockPrescalar(TC1_CLK_IO_BY_1024);
	TC1_FunctionNo = 4;
}
	
/** @brief			TC1_EnableTimerInterrupt				
  * @brief			Enable Timer/Counter1 Timer1 Interrupt.
  * @McuReg			TIMSK[5:2]   TCIE1:OCIE1A:OCIE1B:TOIE1		 
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description    	
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_EnableTimerInterrupt(void)
{
	TIMSK |= TC1_TIMASK_TOIE1 ;	
}

/** @brief			TC1_DisableTimerInterrupt				
  * @brief			Disable Timer/Counter1 Timer1 Interrupt.
  * @McuReg			TIMSK[5:2]   TCIE1:OCIE1A:OCIE1B:TOIE1		 
  * @PreCondition	None
  * @PostCondition  None
  * @param			void
  * @description    	
  * @retval			None
  * @test	Tested OK.		 	
  */
void TC1_DisableTimerInterrupt(void)
{
	TIMSK &= ~(TC1_TIMASK_TOIE1) ;
}


/** @brief			TC1_EnableCompareInterrupt				
  * @brief			Enable Timer/Counter1 Compare Interrupt. 
  * @McuReg			TIMSK[5:2]   TCIE1:OCIE1A:OCIE1B:TOIE1
  * @PreCondition	None
  * @PostCondition  None
  * @param			Channel
  * @description     It has following values
  *					TC1_OCR1A_INTERRUPT	 ...means match interrupt for Output Compare A Enable.
  *					TC1_OCR1B_INTERRUPT...means match interrupt for Output Compare B Enable.
  * @retval			None
  * @test	Tested OK.		 
  */
void TC1_EnableCompareInterrupt(uint8_t u8Channel)
{
	if(u8Channel == TC1_OCR1A_INTERRUPT	)
	{
		TIMSK |= TC1_TIMASK_OCIE1A ;	
	}
	else if(u8Channel == TC1_OCR1B_INTERRUPT)
	{
		TIMSK |= TC1_TIMASK_OCIE1B ;
	}
	else
	{
	}
}		

/** @brief			TC1_DiableCompareInterrupt				
  * @brief			Enable Timer/Counter1 Compare Interrupt . 
  * @McuReg			TIMSK[5:2]   TCIE1:OCIE1A:OCIE1B:TOIE1
  * @PreCondition	None
  * @PostCondition  None
  * @param			Channel
  * @description    It has following values
  *					TC1_OCR1A_INTERRUPT ...means match interrupt for Output Compare A Disable.
  *					TC1_OCR1B_INTERRUPT....means match interrupt for Output Compare B Disable.
  * @retval			None
  * @test	Tested OK.		 
  */
void TC1_DisableCompareInterrupt(uint8_t u8Channel)
{
	if(u8Channel ==  TC1_OCR1A_INTERRUPT)
	{
		TIMSK &= ~(TC1_TIMASK_OCIE1A) ;
	}
	else if(u8Channel == TC1_OCR1B_INTERRUPT)
	{
		TIMSK &= ~(TC1_TIMASK_OCIE1B) ;
	}
	else
	{
	}
}

/** @brief			TC1_EnableInputCaptureInterrupt				
  * @brief			Enable Timer/Counter1 Compare Interrupt. 
  * @McuReg			TIMSK[5:2]   TCIE1:OCIE1A:OCIE1B:TOIE1
  * @PreCondition	None
  * @PostCondition   None
  * @param			Void
  * @description     
  * @retval			None
  * @test	Tested OK.		
 */
void TC1_EnableInputCaptureInterrupt(void)
{
	TIMSK |= TC1_TIMASK_TICIE1 ;	
}				

/** @brief			TC1_DisableInputCaptureInterrupt				
  * @brief			Enable Timer/Counter1 Compare Interrupt. 
  * @McuReg			TIMSK[5:2]   TCIE1:OCIE1A:OCIE1B:TOIE1
  * @PreCondition	None
  * @PostCondition   None
  * @param			Void
  * @description     
  * @retval			None
  * @test	Tested OK.		 
  */
void TC1_DisableInputCaptureInterrupt(void)
{
	TIMSK &= ~(TC1_TIMASK_TICIE1) ;	
}		

 
/** @brief			TC1_RegisterTimerInterruptService			
  * @brief			This register service routine for Timer1 Overflow.
  * @PreCondition	None
  * @PostCondition  None
  * @param	        fun		
  * @description	function pointer to Timer interrupt service routine.
  * @param	        param
  * @description	Additional Parameter if required.
  * @retval			None
  * @test	Tested OK.		   
  */		
void TC1_RegisterTimerInterruptService(fpointerv_t  fun , uint8_t param)
{
	 u8IntParam[TIMER1_OVF_VECT_NO] = param;
	 ISR_FPTR[TIMER1_OVF_VECT_NO] = fun  ;
} 

/** @brief			TC1_RegisterCompareAInterruptService			
  * @brief			This register interrupt service routine for Compare channelA .
  * @PreCondition	None
  * @PostCondition  None
  * @param	        fun
  * @description	function pointer to Timer interrupt service routine.
  * @param	        param
  * @description	Additional Parameter if required.
  * @retval			None  
  */		
void TC1_RegisterCompareAInterruptService(fpointerv_t  fun, uint8_t param)
{
	 u8IntParam[TIMER1_COMPA_VECT_NO] = param;
	 ISR_FPTR[TIMER1_COMPA_VECT_NO] = fun;
} 
/** @brief			TC1_RegisterCompareBInterruptService			
  * @brief			This register interrupt service routine for Compare channel B
  * @PreCondition	None
  * @PostCondition  None
  * @param	        fun
  * @description	function pointer to Timer interrupt service routine.
  * @param	        param
  * @description	Additional Parameter if required.
  * @retval			None  
  */		
void TC1_RegisterCompareBInterruptService(fpointerv_t  fun, uint8_t param)
{
	  u8IntParam[TIMER1_COMPB_VECT_NO] = param;
	  ISR_FPTR[TIMER1_COMPB_VECT_NO] = fun;
} 
/** @brief			TC1_RegisterInputCaptureInterruptService				
  * @brief			This register interrupt service routine for Input Capture.
  * @PreCondition	None
  * @PostCondition  None
  * @param	        fun
  * @description	function pointer to Timer interrupt service routine.
  * @param	        param
  * @description	Additional Parameter if required.
  * @retval			None  
  */		
void TC1_RegisterInputCaptureInterruptService(fpointerv_t  fun, uint8_t param)
{
	  u8IntParam[TIMER1_CAPT_VECT_NO] = param;
	  ISR_FPTR[TIMER1_CAPT_VECT_NO] = fun;
} 

/** @brief			TC1_DummyInterrupt				
  * @brief			This dummy interrupt used to initialize Interrupt function pointer.
  * @PreCondition	None
  * @PostCondition  None
  * @param	        None		
  * @description	None
  * @retval			None  
  */		

void TC1_DummyInterrupt(uint8_t dummy) 
{
	
}

/**
  * @}
 */
